#include <stdio.h>
#include <windows.h>
#include <conio.h>

#define MENU_SIZE 7

char* menu[MENU_SIZE] = {
    "사진 선택",
    "크로마키",
    "흑백",
    "색상반전",
    "색상 강조",
    "블러",
    "종료"
};

void displayMenu(int select) {
	system("cls");

    printf(
        " ______   __     __  __     ______     __            __         __     ______   ______    \n"
        "/\\  == \\ /\\ \\   /\\_\\_\\_\\   /\\  ___\\   /\\ \\          /\\ \\       /\\ \\   /\\__  _\\ /\\  ___\\   \n"
        "\\ \\  _-/ \\ \\ \\  \\/_/\\_\\/_  \\ \\  __\\   \\ \\ \\____     \\ \\ \\____  \\ \\ \\  \\/_/\\ \\/ \\ \\  __\\   \n"
        " \\ \\_\\    \\ \\_\\   /\\_\\/\\_\\  \\ \\_____\\  \\ \\_____\\     \\ \\_____\\  \\ \\_\\    \\ \\_\\  \\ \\_____\\ \n"
        "  \\/_/     \\/_/   \\/_/\\/_/   \\/_____/   \\/_____/      \\/_____/   \\/_/     \\/_/   \\/_____/ \n\n"
    );
    
    printf("=== 메뉴 선택 ===\n\n");

    for (int i = 0; i < MENU_SIZE; i++) {
        if (i == select) {
            printf(" > %s <  \n", menu[i]);
        }
        else {
            printf("  %s   \n", menu[i]);
        }
    }
    printf("=== 메뉴 선택 ===\n\n");

}
